package rt;

public class Main {
    public static void main(String[] args) {
        new Game();
    }
}

/*
В качестве задачи предлагаю вам реализовать код для демонстрации
парадокса Монти Холла и наглядно убедиться в верности парадокса
(запустить игру в цикле на 1000 и вывести итоговый счет).
Необходимо:
+ Создать свой Java Maven или Gradle проект;
+ Подключить зависимость lombok.
+ Можно подумать о подключении какой-нибудь математической библиотеки для работы со статистикой
+ Самостоятельно реализовать прикладную задачу;
+ Сохранить результат в HashMap<шаг теста, результат>
+ Вывести на экран статистику по победам и поражениям

Работы принимаются в виде ссылки на гит репозиторий со всеми ключевыми файлами проекта

>>> Я, конечно, подключил зависимости, но не использую их, поскольку для данной задачи в этом нет необходимости <<<
 */